artillery/artillery-load.yml
config:
  target: "https://dracinshort.xyz"
  phases:
    - duration: 60
      arrivalRate: 50
      name: "Warm up"
    - duration: 120
      arrivalRate: 200
      name: "Ramp up"
    - duration: 180
      arrivalRate: 500
      name: "Peak load"
    - duration: 60
      arrivalRate: 100
      name: "Cool down"
  defaults:
    headers:
      User-Agent: "DracinArtillery/1.0"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Browse & Watch Flow"
    flow:
      - get:
          url: "/api/health"
          capture:
            - json: "$.success"
              as: "healthOk"
      - get:
          url: "/api/dramabox/trending"
      - think: 1
      - get:
          url: "/api/reelshort/homepage"
      - think: 1
      - get:
          url: "/api/netshort/theaters"
      - think: 2
      - get:
          url: "/api/dramabox/search?query=love"
      - think: 1
      - get:
          url: "/api/dramawave/home"
      - get:
          url: "/api/vip/plans"
      - get:
          url: "/api/dotdrama/theaters"
      - get:
          url: "/api/idrama/theaters"