artillery/artillery-spike.yml
config:
  target: "https://dracinshort.xyz"
  phases:
    - duration: 10
      arrivalRate: 1000
      name: "Instant spike"
    - duration: 50
      arrivalRate: 1000
      name: "Sustain spike"
    - duration: 10
      arrivalRate: 10
      name: "Recovery"

scenarios:
  - name: "Spike browse"
    flow:
      - get:
          url: "/api/dramabox/trending"
      - get:
          url: "/api/reelshort/homepage"
      - get:
          url: "/api/dramawave/home"
      - get:
          url: "/api/health"